[
  {
    "type": "crafting",
    "name": "BEACH",
    "description": "There are sights of beautiful birds that fly all over the dry shore land and over the seawaters.\n Wind blowing strongly, and waves crashing against the shore.\n As you stroll along, you can feel the soft smooth green sand under your feet.\n The sand is very hot and walking through it feels like you are walking on a burning grill.\n You must brave the conditions, gather your items here, and build a raft.\n ",
    "items": [],
    "north": "JUNGLE"
  },
  {
    "type": "normal",
    "name": "JUNGLE",
    "description": "At 6.9 million square kilometers (2.72 million square miles),\n the Maximus jungle is roughly the size of the four contiguous United States and covers some 70 percent of the island.\n A river flows through its middle and the sound of birds perching on a lake nearby can be heard if one listens carefully.\n Hidden in the northern part of the jungle is a rope that can come in handy.  ",
    "items": [
      "log",
      "rope"
    ],
    "north": "LAKE",
    "south": "BEACH",
    "east" : "CAVE",
    "west" : "OLD MINE"
  },
  {
    "type": "normal",
    "name": "LAKE",
    "description": "The sight of birds hovering, perching on and diving into this crystal-clear body of water is a sight to behold.\n The lake appears to be clean, but be careful, the water is not safe for drinking",
    "items": [
      "paddle"
    ],
    "south": "JUNGLE"
  },
  {
    "type": "normal",
    "name": "CAVE",
    "description": "A dark and dreary place. The only sound that can be heard is the drip, drip, drip of water from the stalactites.\n The air is thick with humidity, and it is difficult to breathe.\n The darkness is so thick that it's impossible to see more than a few feet in front of you. As you look around,\n you see an old blanket hidden between a pile of rocks. ",
    "items": [
      "cloth",
      "rocks"
    ],
    "west": "JUNGLE"
  },
  {
    "type": "normal",
    "name": "OLD MINE",
    "description": "Abandoned for centuries, this mine smells like scummy standing water.\n It has rough rock walls, with thick cracked support beams every few meters down the shaft. Pieces of metal are scattered around; an old machete and several steel pipes can be seen a few meters from the entrance.\n An object that appears to be the size of a needle can be seen at the bottom of the shaft.\n As you descend to the bottom of the shaft, the object turns out to be a flashlight. ",
    "items": [
      "steelpipe",
      "machete"
    ],
    "east": "JUNGLE"
  }

]
